#include<bits/stdc++.h>
using namespace std;
int main(){
	/*
	
	cmath.h
	
	cmath头文件中声明了一系列函数来计算常见的数学运算和变化
	*-------------------------------------------*
	|函数名				|	作用                |
	|-------------------------------------------|
	|ceil				|	向上取整            |   1
	|-------------------------------------------|
	|floor				|	向下取整            |   1
	|-------------------------------------------|
	|round				|	舍入取整            |   1
	|-------------------------------------------|
	|pow 				|	幂运算              |   2
	|-------------------------------------------|
	|sqrt 				|	计算平方根          |   1
	|-------------------------------------------|
	|log2 				|	对数函数（2）       |
	|-------------------------------------------|
	|log10 				|	对数函数 （10）     |
	|-------------------------------------------|
	|log 				|	对数函数（e）       |
	|-------------------------------------------|
	|modf				|	分解整数和小数      |
	|-------------------------------------------|
	|sin				|	正弦函数            |
	|-------------------------------------------|
	|asin				|	反正弦函数          |
	|-------------------------------------------|
	|cos 				|	余弦函数            |
	|-------------------------------------------|
	|acos				|	反余弦函数          |
	*-------------------------------------------*
	
	关于对数：
	
	对数是什么意思呢？ 比如2的3次方等于8
	
    底	^指数	=	幂
    2	^3  	=	8
    
    8是2的3次幂
    3是8以2为底的对数（可以理解为指数是幂以底为底的对数 ）
    
    log2(8)=3; 可以理解为 2要乘以自己多少次才能等于8（已知底和幂，求指数 ）
    log10(x); 可以理解为10要乘以自己多少次才能等于X （已知底和幂,求指数）
    
    log(x);计算自然常数e的对数
    自然常数符号e为数学中一个常数，是一个无限不循环小数，且为超越数，其值约为2.718281828459045
    也就可以理解为自然常数e要乘以多少次自己才会等于X
    
    
    modf(x,&a)
    把浮点数X的整数和小数部分分开
    
    函数的结果是小数部分，整数部分记录在a中

	*/
}

